#author yuqiang time:2020/11/18
import numpy as np

# 双目相机参数
class stereoCamera(object):
    def __init__(self):
        # 左相机内参
        self.cam_matrix_left = np.array([[481.2652,1.1071, 350.9912],
                                          [0,480.0198, 238.675],
                                          [0., 0., 1.]])
        # 右相机内参
        self.cam_matrix_right = np.array([[478.7584, 0.7950, 361.9022],
                                          [0., 477.9388, 236.5479],
                                          [0., 0., 1.]])

        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[0.0805,-0.0142,-0.0016,-0.0032, -0.2123]])
        self.distortion_r = np.array([[0.0877, -0.0705, -0.0011,-0.0031, -0.1156]])

        # 旋转矩阵
        self.R = np.array([[1.0000, -0.0017, 0.0095],
                           [0.0016, 1.0000, 0.0052],
                           [-0.0095, -0.0052, 0.9999]])

        # 平移矩阵
        self.T = np.array([-62.7304, -0.0344, 0.0541])

        # 焦距
        self.focal_length = 5.25558800e+02  # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3]，3行4列，焦距是多少，这个程序没调用这个参数

        # 基线距离
        self.baseline = 62.7304  # 单位：mm， 为平移向量的第一个参数（取绝对值）